telespial/EdgeAI_Package_Transport_Adaptive_Reasoning_demo_NXP_FRDM-MCXN947/src/edgeai_package_transport_anomaly_demo.c
    if (BoardTempI3CInit())
    {
        PRINTF("DIAG I3C1(I2C-mode) addr:");
        for (uint8_t addr = 0x08u; addr <= 0x77u; addr++)
        {
            if (DiagI3CProbeAddrI2C(addr))
            {
                PRINTF(" 0x%02x", (unsigned int)addr);
                any_i3c = true;
            }
        }
        if (!any_i3c)
        {
            PRINTF(" none");
        }
        PRINTF("\r\n");
    }
    else
    {
        PRINTF("DIAG I3C1 init_failed\r\n");
    }
    PRINTF("DIAG done shield datastream scan\r\n");
#endif
}

static const char *ShieldImuName(uint8_t who)
{
    if (who == SHIELD_IMU_WHOAMI_LSM6DSO16IS)
    {
        return "LSM6DSO16IS";
    }
    if (who == SHIELD_IMU_WHOAMI_LSM6DSV16X)
    {
        return "LSM6DSV16X";
    }
    return "UNKNOWN";
}

static bool ShieldImuSupportsShub(uint8_t who)
{
    return (who == SHIELD_IMU_WHOAMI_LSM6DSO16IS) || (who == SHIELD_IMU_WHOAMI_LSM6DSV16X);
}

static void ShieldSensorScanLog(void)
{
#if EDGEAI_ENABLE_SHIELD_SENSOR_SCAN_LOG
    static const bool buses[2] = {true, false};
    static const char *bus_name[2] = {"FC2", "FC3"};
    static const uint8_t stts_addrs[] = {0x3Cu, 0x3Du, 0x3Eu, 0x3Fu, 0x38u};
    uint8_t who = 0u;

    for (uint32_t bi = 0u; bi < 2u; bi++)
    {
        bool use_touch_bus = buses[bi];
        ShieldScanI2CAddresses(use_touch_bus, bus_name[bi]);
        if (ShieldBusRead(use_touch_bus, SHIELD_LIS2DUXS12_ADDR0, SHIELD_GYRO_REG_WHO_AM_I, &who, 1u) ||
            ShieldBusRead(use_touch_bus, SHIELD_LIS2DUXS12_ADDR1, SHIELD_GYRO_REG_WHO_AM_I, &who, 1u))
        {
            PRINTF("SHIELD probe %s LIS2DUXS12 who=0x%02x %s\r\n",
                   bus_name[bi],
                   (unsigned int)who,
                   (who == SHIELD_LIS2DUXS12_WHOAMI) ? "ok" : "unexpected");
        }
        else
        {
            PRINTF("SHIELD probe %s LIS2DUXS12 not_found\r\n", bus_name[bi]);
        }

        if (ShieldBusRead(use_touch_bus, SHIELD_LPS22DF_ADDR0, SHIELD_GYRO_REG_WHO_AM_I, &who, 1u) ||
            ShieldBusRead(use_touch_bus, SHIELD_LPS22DF_ADDR1, SHIELD_GYRO_REG_WHO_AM_I, &who, 1u))
        {
            PRINTF("SHIELD probe %s LPS22DF who=0x%02x %s\r\n",
                   bus_name[bi],
                   (unsigned int)who,
                   (who == SHIELD_LPS22DF_WHOAMI) ? "ok" : "unexpected");
        }
        else
        {
            PRINTF("SHIELD probe %s LPS22DF not_found\r\n", bus_name[bi]);
        }

        if (ShieldBusRead(use_touch_bus, SHIELD_LIS2MDL_ADDR, SHIELD_LIS2MDL_REG_WHO_AM_I, &who, 1u))
        {
            PRINTF("SHIELD probe %s LIS2MDL who=0x%02x %s\r\n",
                   bus_name[bi],
                   (unsigned int)who,
                   (who == SHIELD_LIS2MDL_WHOAMI) ? "ok" : "unexpected");
        }
        else
        {
            PRINTF("SHIELD probe %s LIS2MDL not_found\r\n", bus_name[bi]);
        }

        if (ShieldBusRead(use_touch_bus, SHIELD_LIS2MDL_ADDR_ALT, SHIELD_LIS2MDL_REG_WHO_AM_I, &who, 1u))
        {
            PRINTF("SHIELD probe %s LIS2MDL_ALT who=0x%02x %s\r\n",
                   bus_name[bi],
                   (unsigned int)who,
                   (who == SHIELD_LIS2MDL_WHOAMI) ? "ok" : "unexpected");
        }
        else
        {
            PRINTF("SHIELD probe %s LIS2MDL_ALT not_found\r\n", bus_name[bi]);
        }

        if (ShieldBusProbeAddress(use_touch_bus, SHIELD_SHT40_ADDR0) || ShieldBusProbeAddress(use_touch_bus, SHIELD_SHT40_ADDR1))
        {
            PRINTF("SHIELD probe %s SHT4x present\r\n", bus_name[bi]);
        }
        else
        {
            PRINTF("SHIELD probe %s SHT4x not_found\r\n", bus_name[bi]);
        }

        {
            bool stts_found = false;
            for (uint32_t i = 0u; i < (sizeof(stts_addrs) / sizeof(stts_addrs[0])); i++)
            {
                if (ShieldBusRead(use_touch_bus, stts_addrs[i], SHIELD_STTS22H_REG_WHO_AM_I, &who, 1u))
                {
                    PRINTF("SHIELD probe %s STTS22H addr=0x%02x who=0x%02x %s\r\n",
                           bus_name[bi],
                           (unsigned int)stts_addrs[i],
                           (unsigned int)who,
                           (who == SHIELD_STTS22H_WHOAMI) ? "ok" : "candidate");
                    stts_found = true;
                    break;
                }
            }
            if (!stts_found)
            {
                PRINTF("SHIELD probe %s STTS22H not_found\r\n", bus_name[bi]);
            }
        }
    }

    if (!s_shield_gyro_ready)
    {
        ShieldGyroInit();
    }
    if (s_shield_gyro_ready && ShieldImuSupportsShub(s_shield_gyro_who))
    {
        static const uint8_t stts_addrs[] = {0x3Cu, 0x3Du, 0x3Eu, 0x3Fu, 0x38u};
        uint8_t who = 0u;
        bool stts_found = false;

        if (ShieldShubReadRegs(SHIELD_LIS2MDL_ADDR, SHIELD_LIS2MDL_REG_WHO_AM_I, &who, 1u) ||
            ShieldShubReadRegs(SHIELD_LIS2MDL_ADDR_ALT, SHIELD_LIS2MDL_REG_WHO_AM_I, &who, 1u))
        {
            PRINTF("SHIELD_SHUB probe LIS2MDL who=0x%02x %s\r\n",
                   (unsigned int)who,
                   (who == SHIELD_LIS2MDL_WHOAMI) ? "ok" : "unexpected");
        }
        else
        {
            PRINTF("SHIELD_SHUB probe LIS2MDL not_found\r\n");
        }

        if (ShieldShubReadRegs(SHIELD_LPS22DF_ADDR0, SHIELD_GYRO_REG_WHO_AM_I, &who, 1u) ||
            ShieldShubReadRegs(SHIELD_LPS22DF_ADDR1, SHIELD_GYRO_REG_WHO_AM_I, &who, 1u))
        {
            PRINTF("SHIELD_SHUB probe LPS22DF who=0x%02x %s\r\n",
                   (unsigned int)who,
                   (who == SHIELD_LPS22DF_WHOAMI) ? "ok" : "unexpected");
        }
        else
        {
            PRINTF("SHIELD_SHUB probe LPS22DF not_found\r\n");
        }

        for (uint32_t i = 0u; i < (sizeof(stts_addrs) / sizeof(stts_addrs[0])); i++)
        {
            if (ShieldShubReadRegs(stts_addrs[i], SHIELD_STTS22H_REG_WHO_AM_I, &who, 1u))
            {
                PRINTF("SHIELD_SHUB probe STTS22H addr=0x%02x who=0x%02x %s\r\n",
                       (unsigned int)stts_addrs[i],
                       (unsigned int)who,
                       (who == SHIELD_STTS22H_WHOAMI) ? "ok" : "candidate");
                stts_found = true;
                break;
            }
        }
        if (!stts_found)
        {
            PRINTF("SHIELD_SHUB probe STTS22H not_found\r\n");
        }
    }
    else if (s_shield_gyro_ready)
    {
        PRINTF("SHIELD_SHUB probe skipped: unsupported imu who=0x%02x\r\n", (unsigned int)s_shield_gyro_who);
    }
    else
    {
        PRINTF("SHIELD_SHUB probe skipped: gyro_not_ready\r\n");
    }
#endif
}

#if EDGEAI_SENSOR_SCAN_MODE
static int SensorScanModeMain(void)
{
    uint32_t core_hz;

    BOARD_InitHardware();
    core_hz = CLOCK_GetCoreSysClkFreq();
    if (core_hz == 0u)
    {
        core_hz = CoreClockHz();
    }

    PRINTF("SENSOR_SCAN_MODE active\r\n");
    PRINTF("Tip: remove LCD, keep shield attached, then reboot this scan image.\r\n");

    for (;;)
    {
        ShieldRunDatastreamDiagnostics();
        ShieldSensorScanLog();
        SDK_DelayAtLeastUs(2000000u, core_hz);
    }

