telespial/EdgeAI_Package_Transport_Adaptive_Reasoning_demo_NXP_FRDM-MCXN947/src/edgeai_package_transport_anomaly_demo.c
    if (!s_shield_gyro_ready)
    {
        ShieldGyroInit();
        if (!s_shield_gyro_ready)
        {
            GaugeRender_SetAccel(0, 0, 1000, false);
            GaugeRender_SetLinearAccel(0, 0, 1000, false);
            return;
        }
    }

    if (!s_shield_gyro_ready)
    {
        GaugeRender_SetAccel(0, 0, 1000, false);
        GaugeRender_SetLinearAccel(0, 0, 1000, false);
        return;
    }

    if (!ShieldBusRead(s_shield_use_touch_bus, s_shield_gyro_addr, SHIELD_GYRO_REG_OUTX_L_G, raw_g, sizeof(raw_g)))
    {
        if (s_shield_gyro_read_fail_streak < 255u)
        {
            s_shield_gyro_read_fail_streak++;
        }
        if (s_shield_gyro_read_fail_streak >= 5u)
        {
            s_shield_gyro_ready = false;
        }
        if (!s_shield_gyro_read_fail_logged)
        {
            PRINTF("SHIELD_GYRO read fail (gyro) addr=0x%02x\r\n", (unsigned int)s_shield_gyro_addr);
            s_shield_gyro_read_fail_logged = true;
        }
        return;
    }
    if (!ShieldBusRead(s_shield_use_touch_bus, s_shield_gyro_addr, SHIELD_GYRO_REG_OUTX_L_A, raw_a, sizeof(raw_a)))
    {
        if (s_shield_gyro_read_fail_streak < 255u)
        {
            s_shield_gyro_read_fail_streak++;
        }
        if (s_shield_gyro_read_fail_streak >= 5u)
        {
            s_shield_gyro_ready = false;
        }
        if (!s_shield_gyro_read_fail_logged)
        {
            PRINTF("SHIELD_GYRO read fail (accel) addr=0x%02x\r\n", (unsigned int)s_shield_gyro_addr);
            s_shield_gyro_read_fail_logged = true;
        }
        return;
    }
    s_shield_gyro_read_fail_streak = 0u;
    s_shield_gyro_read_fail_logged = false;

    ax_raw = (int16_t)(((uint16_t)raw_a[1] << 8) | raw_a[0]);
    ay_raw = (int16_t)(((uint16_t)raw_a[3] << 8) | raw_a[2]);
    az_raw = (int16_t)(((uint16_t)raw_a[5] << 8) | raw_a[4]);

    /* LSM6DSV16X reads ~2x high with 0.122 mg/LSB on this setup; use 0.061 mg/LSB. */
    accel_mg_per_lsb_x1000 = (s_shield_gyro_who == SHIELD_IMU_WHOAMI_LSM6DSV16X) ? 61 : 122;
    ax_mg = ((int32_t)ax_raw * accel_mg_per_lsb_x1000) / 1000;
    ay_mg = ((int32_t)ay_raw * accel_mg_per_lsb_x1000) / 1000;
    az_mg = ((int32_t)az_raw * accel_mg_per_lsb_x1000) / 1000;

    /* Stable absolute tilt mapping from accel only (no gyro boost, no axis swap). */
    filt_ax = (int16_t)((s_accel_x_mg * 3 + ax_mg) / 4);
    filt_ay = (int16_t)((s_accel_y_mg * 3 + ay_mg) / 4);
    filt_az = (int16_t)((s_accel_z_mg * 3 + az_mg) / 4);
    s_accel_x_mg = filt_ax;
    s_accel_y_mg = filt_ay;
    s_accel_z_mg = filt_az;

    s_ui_gyro_x = filt_ax;
    s_ui_gyro_y = filt_ay;
    s_ui_gyro_z = filt_az;
    GaugeRender_SetLinearAccel(s_accel_x_mg, s_accel_y_mg, s_accel_z_mg, true);
    GaugeRender_SetAccel(s_ui_gyro_x, s_ui_gyro_y, s_ui_gyro_z, true);
}

static bool BoardTempReadRaw(uint8_t addr, i3c_bus_type_t bus_type, uint8_t *raw2)
{
    i3c_master_transfer_t xfer;
    memset(&xfer, 0, sizeof(xfer));
    xfer.flags = kI3C_TransferDefaultFlag;
    xfer.slaveAddress = addr;
    xfer.direction = kI3C_Read;
    xfer.subaddress = BOARD_TEMP_REG;
    xfer.subaddressSize = 1u;
    xfer.data = raw2;
    xfer.dataSize = 2u;
    xfer.busType = bus_type;
    xfer.ibiResponse = kI3C_IbiRespAck;
    return (I3C_MasterTransferBlocking(TEMP_I3C, &xfer) == kStatus_Success);
}

static status_t BoardTempAssignDynamicAddress(void)
{
    i3c_master_transfer_t xfer;
    uint8_t ccc;
    uint8_t payload;

    /* RSTDAA to clear stale dynamic addresses. */
    memset(&xfer, 0, sizeof(xfer));
    ccc = I3C_CCC_RSTDAA;
    xfer.slaveAddress = I3C_BROADCAST_ADDR;
    xfer.direction = kI3C_Write;
    xfer.busType = kI3C_TypeI3CSdr;
    xfer.data = &ccc;
    xfer.dataSize = 1u;
    xfer.flags = kI3C_TransferDefaultFlag;
    if (I3C_MasterTransferBlocking(TEMP_I3C, &xfer) != kStatus_Success)
    {
        return kStatus_Fail;
    }

    /* SETDASA command phase. */
    memset(&xfer, 0, sizeof(xfer));
    ccc = I3C_CCC_SETDASA;
    xfer.slaveAddress = I3C_BROADCAST_ADDR;
    xfer.direction = kI3C_Write;
    xfer.busType = kI3C_TypeI3CSdr;
    xfer.data = &ccc;
    xfer.dataSize = 1u;
    xfer.flags = kI3C_TransferNoStopFlag;
    if (I3C_MasterTransferBlocking(TEMP_I3C, &xfer) != kStatus_Success)
    {
        return kStatus_Fail;
    }

    /* SETDASA payload phase: assign dynamic address to static 0x48 target. */
    memset(&xfer, 0, sizeof(xfer));
    payload = (uint8_t)(TEMP_SENSOR_DYNAMIC_ADDR << 1);
    xfer.slaveAddress = TEMP_SENSOR_STATIC_ADDR;
    xfer.direction = kI3C_Write;
    xfer.busType = kI3C_TypeI3CSdr;
    xfer.data = &payload;
    xfer.dataSize = 1u;
    xfer.flags = kI3C_TransferDefaultFlag;
    return I3C_MasterTransferBlocking(TEMP_I3C, &xfer);
}

static bool BoardTempDecodeC10(const uint8_t *raw, int32_t *temp_c10_out)
{
    int16_t raw12;
    int32_t temp_c10;

    if ((raw == NULL) || (temp_c10_out == NULL))
    {
        return false;
    }

    raw12 = (int16_t)((((uint16_t)raw[0] << 8) | raw[1]) >> 4);
    if ((raw12 & 0x0800) != 0)
    {
        raw12 |= (int16_t)0xF000;
    }
    /* P3T1755 is 12-bit, 0.0625C/LSB (1/16 C) => 0.625 tenth-C/LSB. */
    temp_c10 = ((int32_t)raw12 * 5) / 8;

    /* Reject clearly invalid values to avoid latching wrong targets. */
    if ((temp_c10 < -400) || (temp_c10 > 1250))
    {
        return false;
    }

    *temp_c10_out = temp_c10;
    return true;
}

static bool BoardTempDecodeC(const uint8_t *raw, int32_t *temp_c_out)
{
    int32_t temp_c10;
    if ((raw == NULL) || (temp_c_out == NULL))
    {
        return false;
    }
    if (!BoardTempDecodeC10(raw, &temp_c10))
    {
        return false;
    }
    *temp_c_out = temp_c10 / 10;
    return true;
}

static bool BoardTempProbeAddr(uint8_t addr, i3c_bus_type_t bus_type, int32_t *temp_c_out)
{
    uint8_t raw_a[2];
    uint8_t raw_b[2];
    int32_t ta;
    int32_t tb;
    int32_t dt;

    if ((temp_c_out == NULL) || !BoardTempReadRaw(addr, bus_type, raw_a) || !BoardTempReadRaw(addr, bus_type, raw_b))
    {
        return false;
    }
    if (!BoardTempDecodeC(raw_a, &ta) || !BoardTempDecodeC(raw_b, &tb))
    {
        return false;
    }

    dt = ta - tb;
    if (dt < 0)
    {
        dt = -dt;
    }
    if (dt > 3)
    {
        return false;
    }

