telespial/EdgeAI_Package_Transport_Adaptive_Reasoning_demo_NXP_FRDM-MCXN947/src/edgeai_package_transport_anomaly_demo.c
static bool TouchInHelpClose(int32_t x, int32_t y)
{
    int32_t bx1 = GAUGE_RENDER_HELP_PANEL_X1 - 8;
    int32_t bx0 = bx1 - 22;
    int32_t by0 = GAUGE_RENDER_HELP_PANEL_Y0 + 8;
    int32_t by1 = by0 + 22;
    return (x >= bx0) && (x <= bx1) && (y >= by0) && (y <= by1);
}

static bool TouchInSettingsModeIndex(int32_t x, int32_t y, uint8_t idx)
{
    int32_t x0 = GAUGE_RENDER_SET_MODE_X0 + (int32_t)idx * (GAUGE_RENDER_SET_MODE_W + GAUGE_RENDER_SET_MODE_GAP);
    int32_t x1 = x0 + GAUGE_RENDER_SET_MODE_W - 1;
    int32_t y0 = GAUGE_RENDER_SET_MODE_Y0;
    int32_t y1 = y0 + GAUGE_RENDER_SET_MODE_H - 1;
    return (x >= x0) && (x <= x1) && (y >= y0) && (y <= y1);
}

static bool TouchInSettingsTuneIndex(int32_t x, int32_t y, uint8_t idx)
{
    int32_t x0 = GAUGE_RENDER_SET_TUNE_X0 + (int32_t)idx * (GAUGE_RENDER_SET_TUNE_W + GAUGE_RENDER_SET_TUNE_GAP);
    int32_t x1 = x0 + GAUGE_RENDER_SET_TUNE_W - 1;
    int32_t y0 = GAUGE_RENDER_SET_TUNE_Y0;
    int32_t y1 = y0 + GAUGE_RENDER_SET_TUNE_H - 1;
    return (x >= x0) && (x <= x1) && (y >= y0) && (y <= y1);
}

int main(void)
{
#if EDGEAI_SENSOR_SCAN_MODE
    return SensorScanModeMain();
#else
    bool ai_enabled = true;
    bool lcd_ok;
    bool ext_flash_ok;
    bool help_visible = false;
    bool settings_visible = false;
    bool ui_block_touch = false;
    bool record_mode;
    bool prev_record_mode;
    bool playback_active = false;
    ext_flash_sample_t playback_sample;
    uint32_t data_tick_accum_us = 0u;
    uint32_t recplay_tick_accum_us = 0u;
    uint32_t render_tick_accum_us = 0u;
    uint32_t gyro_tick_accum_us = 0u;
    uint32_t accel_live_tick_accum_us = 0u;
    uint32_t runtime_clock_tick_accum_us = 0u;
    uint32_t temp_tick_accum_us = 0u;
    uint32_t shield_aux_tick_accum_us = 0u;
    uint32_t accel_test_tick_accum_us = 0u;
    uint32_t runtime_elapsed_ds = 0u;
    uint32_t runtime_displayed_sec = UINT32_MAX;
    uint32_t rec_elapsed_ds = 0u;
    uint32_t play_off = 0u;
    uint32_t play_cnt = 0u;
    uint32_t rec_cnt = 0u;
    const power_sample_t *sample;
    anomaly_mode_t anom_mode;
    uint64_t time_prev_ticks = 0u;
    uint64_t time_us_rem = 0u;
    uint64_t runtime_clock_start_ticks = 0u;

    BOARD_InitHardware();
    ext_flash_ok = ExtFlashRecorder_Init();
    PRINTF("EXT_FLASH_REC: %s\r\n", ext_flash_ok ? "ready" : "init_failed");

    lcd_ok = GaugeRender_Init();
    PRINTF("EV dash LCD: %s\r\n", lcd_ok ? "ready" : "init_failed");

    PowerData_Init();
    PowerData_SetAiAssistEnabled(ai_enabled);
    AnomalyEngine_Init();
    anom_mode = AnomalyEngine_GetMode();
    ShieldGyroInit();
    ShieldRunDatastreamDiagnostics();
    ShieldSensorScanLog();
    TouchInit();
    BoardTempInit();
    BoardTempUpdate();
    ShieldGyroUpdate();
    ShieldAuxInit();
    (void)TimebaseInit();
    time_prev_ticks = TimebaseNowTicks();
    runtime_clock_start_ticks = time_prev_ticks;
    GaugeRender_SetRuntimeClock(0u, 0u, 0u, 0u, true);
    GaugeRender_SetHelpVisible(false);
    GaugeRender_SetSettingsVisible(false);
    memset(&s_anom_out, 0, sizeof(s_anom_out));
    AnomalyEngine_GetOutput(&s_anom_out);
    GaugeRender_SetAnomalyInfo((uint8_t)s_anom_out.mode,
                               (uint8_t)s_anom_out.tune,
                               s_anom_out.training_active,
                               s_anom_out.trained_ready,
                               (uint8_t)s_anom_out.channel_level[ANOMALY_CH_AX],
                               (uint8_t)s_anom_out.channel_level[ANOMALY_CH_AY],
                               (uint8_t)s_anom_out.channel_level[ANOMALY_CH_AZ],
                               (uint8_t)s_anom_out.channel_level[ANOMALY_CH_TEMP],
                               (uint8_t)s_anom_out.overall_level);
    sample = GetFrameSample();
    if (lcd_ok && (sample != NULL))
    {
        GaugeRender_DrawFrame(sample, ai_enabled, PowerData_GetReplayProfile());
    }
    prev_record_mode = GaugeRender_IsRecordMode();
    if (!prev_record_mode)
    {
        playback_active = ext_flash_ok && ExtFlashRecorder_StartPlayback();
        runtime_elapsed_ds = 0u;
        runtime_displayed_sec = UINT32_MAX;
        runtime_clock_start_ticks = TimebaseNowTicks();
        GaugeRender_SetRuntimeClock(0u, 0u, 0u, 0u, true);
        PRINTF("EXT_FLASH_PLAY: %s\r\n", playback_active ? "ready" : "no_data");
        if (playback_active && ExtFlashRecorder_GetPlaybackInfo(&play_off, &play_cnt))
        {
            PRINTF("EXT_FLASH_PLAY_INFO: offset=%u count=%u\r\n", (unsigned int)play_off, (unsigned int)play_cnt);
        }
    }

    PRINTF("EV dash app ready\r\n");

    for (;;)
    {
        int32_t tx = 0;
        int32_t ty = 0;
        bool modal_active;
        bool modal_active_now;
        bool pressed = TouchGetPoint(&tx, &ty);
        bool in_pill;
        bool in_set;
        bool in_help;
        bool timeline_changed = GaugeRender_HandleTouch(tx, ty, pressed);
        bool record_start_request;

        modal_active = GaugeRender_IsRecordConfirmActive();
        in_set = pressed && !modal_active && TouchInAiSet(tx, ty);
        in_help = pressed && !modal_active && TouchInAiHelp(tx, ty);
        in_pill = pressed && !modal_active && TouchInAiPill(tx, ty) && !in_set && !in_help;

        if (ui_block_touch)
        {
            if (!pressed)
            {
                ui_block_touch = false;
            }
            in_set = false;
            in_help = false;
            in_pill = false;
        }

        if (pressed && !s_touch_was_down && !modal_active && !ui_block_touch)
        {
            bool redraw_ui = false;

            if (help_visible)
            {
                if (TouchInHelpClose(tx, ty) || in_help)
                {
                    help_visible = false;
                    GaugeRender_SetHelpVisible(false);
                    redraw_ui = true;
                }
                else if (!TouchInHelpPanel(tx, ty))
                {
                    help_visible = false;
                    GaugeRender_SetHelpVisible(false);
                    redraw_ui = true;
                }
            }
            else if (settings_visible)
            {
                bool handled_setting = false;

                if (TouchInSettingsClose(tx, ty))
                {
                    settings_visible = false;
                    GaugeRender_SetSettingsVisible(false);
                    redraw_ui = true;
                    handled_setting = true;
                }

                for (uint8_t i = 0u; i < 3u; i++)
                {
                    if (!handled_setting && TouchInSettingsModeIndex(tx, ty, i))
                    {
                        anom_mode = (anomaly_mode_t)i;
                        AnomalyEngine_SetMode(anom_mode);
                        if (anom_mode == ANOMALY_MODE_TRAINED_MONITOR)
                        {
                            AnomalyEngine_StartTraining();
                        }
                        handled_setting = true;
                        redraw_ui = true;
                        PRINTF("ANOM_MODE,%u\r\n", (unsigned int)anom_mode);
                        break;
                    }
                }

                if (!handled_setting)
                {
                    for (uint8_t i = 0u; i < 3u; i++)
                    {
                        if (TouchInSettingsTuneIndex(tx, ty, i))
                        {
                            AnomalyEngine_SetTune((anomaly_tune_t)i);
                            handled_setting = true;
                            redraw_ui = true;
                            PRINTF("ANOM_TUNE,%u\r\n", (unsigned int)i);
                            break;
                        }
                    }
                }

                if (!handled_setting)
                {
                    if (in_set || !TouchInSettingsPanel(tx, ty))
                    {
                        settings_visible = false;
                        GaugeRender_SetSettingsVisible(false);
                        redraw_ui = true;
                    }
                }

                if (redraw_ui)
                {
                    AnomalyEngine_GetOutput(&s_anom_out);
                    GaugeRender_SetAnomalyInfo((uint8_t)s_anom_out.mode,
                                               (uint8_t)s_anom_out.tune,
                                               s_anom_out.training_active,
                                               s_anom_out.trained_ready,
                                               (uint8_t)s_anom_out.channel_level[ANOMALY_CH_AX],
                                               (uint8_t)s_anom_out.channel_level[ANOMALY_CH_AY],
                                               (uint8_t)s_anom_out.channel_level[ANOMALY_CH_AZ],
                                               (uint8_t)s_anom_out.channel_level[ANOMALY_CH_TEMP],
                                               (uint8_t)s_anom_out.overall_level);
                    if (lcd_ok)
                    {
                        GaugeRender_DrawFrame(GetFrameSample(), ai_enabled, PowerData_GetReplayProfile());
                    }
                }
            }
            else if (in_set)
            {
                settings_visible = true;
                help_visible = false;
                GaugeRender_SetHelpVisible(false);
                GaugeRender_SetSettingsVisible(true);
                redraw_ui = true;
            }
            else if (in_help)
            {
                help_visible = true;
                settings_visible = false;
                GaugeRender_SetSettingsVisible(false);
                GaugeRender_SetHelpVisible(true);
                redraw_ui = true;
                PRINTF("UI_HELP,ON\r\n");
            }

            if (redraw_ui && lcd_ok)
            {
                GaugeRender_DrawFrame(GetFrameSample(), ai_enabled, PowerData_GetReplayProfile());
            }
        }

        if (in_pill && !s_touch_was_down)
        {
            ai_enabled = !ai_enabled;
            PowerData_SetAiAssistEnabled(ai_enabled);
            PRINTF("AI_TOGGLE,%s\r\n", ai_enabled ? "ON" : "OFF");
            if (lcd_ok)
            {
                GaugeRender_DrawFrame(GetFrameSample(), ai_enabled, PowerData_GetReplayProfile());
            }
        }
        if (timeline_changed && lcd_ok)
        {
            GaugeRender_DrawFrame(GetFrameSample(), ai_enabled, PowerData_GetReplayProfile());
        }
        if (timeline_changed && !GaugeRender_IsRecordMode() && !GaugeRender_IsRecordConfirmActive())
        {
            playback_active = ext_flash_ok && ExtFlashRecorder_StartPlayback();
            runtime_elapsed_ds = 0u;
            runtime_displayed_sec = UINT32_MAX;
            runtime_clock_start_ticks = TimebaseNowTicks();
            GaugeRender_SetRuntimeClock(0u, 0u, 0u, 0u, true);
            PRINTF("EXT_FLASH_PLAY: %s\r\n", playback_active ? "restart" : "no_data");
            if (playback_active && ExtFlashRecorder_GetPlaybackInfo(&play_off, &play_cnt))
            {
                PRINTF("EXT_FLASH_PLAY_INFO: offset=%u count=%u\r\n", (unsigned int)play_off, (unsigned int)play_cnt);
            }
        }
        record_start_request = GaugeRender_ConsumeRecordStartRequest();
        if (record_start_request)
        {
            bool cleared = ext_flash_ok && ExtFlashRecorder_ClearAll();
            if (cleared)
            {
                GaugeRender_SetRecordMode(true);
                playback_active = false;
                runtime_elapsed_ds = 0u;
                rec_elapsed_ds = 0u;
                runtime_displayed_sec = UINT32_MAX;
                runtime_clock_start_ticks = TimebaseNowTicks();
                GaugeRender_SetRuntimeClock(0u, 0u, 0u, 0u, true);
                if (anom_mode == ANOMALY_MODE_TRAINED_MONITOR)
                {
                    AnomalyEngine_StartTraining();
                }
                PRINTF("EXT_FLASH_REC: cleared_start\r\n");
                GaugeRender_SetPlayhead(99u, true);
            }
            else
            {
                GaugeRender_SetRecordMode(false);
                playback_active = ext_flash_ok && ExtFlashRecorder_StartPlayback();
                runtime_elapsed_ds = 0u;
                runtime_displayed_sec = UINT32_MAX;
                runtime_clock_start_ticks = TimebaseNowTicks();
                GaugeRender_SetRuntimeClock(0u, 0u, 0u, 0u, true);
                PRINTF("EXT_FLASH_REC: clear_failed\r\n");
            }
            if (lcd_ok)
            {
                GaugeRender_DrawFrame(GetFrameSample(), ai_enabled, PowerData_GetReplayProfile());
            }
        }
        s_touch_was_down = pressed;
        modal_active_now = GaugeRender_IsRecordConfirmActive() || help_visible || settings_visible;
        record_mode = GaugeRender_IsRecordMode();
        if (record_mode != prev_record_mode)
        {
            if (!record_mode)
            {
                if (anom_mode == ANOMALY_MODE_TRAINED_MONITOR)
                {
                    AnomalyEngine_StopTraining();
                }
                playback_active = ext_flash_ok && ExtFlashRecorder_StartPlayback();
                runtime_elapsed_ds = 0u;
                runtime_displayed_sec = UINT32_MAX;
                runtime_clock_start_ticks = TimebaseNowTicks();
                GaugeRender_SetRuntimeClock(0u, 0u, 0u, 0u, true);
                PRINTF("EXT_FLASH_PLAY: %s\r\n", playback_active ? "ready" : "no_data");
                if (playback_active && ExtFlashRecorder_GetPlaybackInfo(&play_off, &play_cnt))
                {
                    PRINTF("EXT_FLASH_PLAY_INFO: offset=%u count=%u\r\n", (unsigned int)play_off, (unsigned int)play_cnt);
                }
            }
            else
            {
                if (anom_mode == ANOMALY_MODE_TRAINED_MONITOR)
                {
                    AnomalyEngine_StartTraining();
                }
                playback_active = false;
                runtime_elapsed_ds = 0u;
                rec_elapsed_ds = 0u;
                runtime_displayed_sec = UINT32_MAX;
                runtime_clock_start_ticks = TimebaseNowTicks();
                GaugeRender_SetRuntimeClock(0u, 0u, 0u, 0u, true);
                PRINTF("EXT_FLASH_REC: active\r\n");
                if (ext_flash_ok && ExtFlashRecorder_GetRecordInfo(&rec_cnt))
                {
                    PRINTF("EXT_FLASH_REC_INFO: count=%u\r\n", (unsigned int)rec_cnt);
                }
                GaugeRender_SetPlayhead(99u, true);
            }
            prev_record_mode = record_mode;
        }

        {
            uint32_t elapsed_loop_us;
            if (s_timebase_ready)
            {
                uint64_t now_ticks = TimebaseNowTicks();
                uint64_t dt_ticks = now_ticks - time_prev_ticks;
                uint64_t us_num = (dt_ticks * 1000000ull) + time_us_rem;
                time_prev_ticks = now_ticks;
                elapsed_loop_us = (uint32_t)(us_num / s_timebase_hz);
                time_us_rem = us_num % s_timebase_hz;
            }
            else
            {
                elapsed_loop_us = TOUCH_POLL_DELAY_US;
            }

            if (elapsed_loop_us == 0u)
            {
                elapsed_loop_us = TOUCH_POLL_DELAY_US;
            }
            if (elapsed_loop_us > 250000u)
            {
                elapsed_loop_us = 250000u;
            }

            runtime_clock_tick_accum_us += elapsed_loop_us;
            data_tick_accum_us += elapsed_loop_us;
            recplay_tick_accum_us += elapsed_loop_us;
            render_tick_accum_us += elapsed_loop_us;
            gyro_tick_accum_us += elapsed_loop_us;
            accel_live_tick_accum_us += elapsed_loop_us;
            temp_tick_accum_us += elapsed_loop_us;
            shield_aux_tick_accum_us += elapsed_loop_us;
            accel_test_tick_accum_us += elapsed_loop_us;

